[
  {
    "level": "A1",
    "topics": [
      {
        "title": "Менің күнім (Мой день)",
        "description": "Күнделікті өмір туралы қысқа мәтін.",
        "text": "Мен таңертең сағат жетіде оянамын. Терезеден күн сәулесі түсіп, бөлме жылы болады. Бетімді жуып, тісімді тазалаймын. Анам ас үйде таңғы ас дайындап жатады. Мен үстелге отырып, ботқа мен шай ішемін. Таңғы астан кейін мектепке дайындаламын. Киімімді киіп, сөмкемді аламын. Мектепке жаяу барамын, жолда достарымды көремін. Сабақтар қызықты өтеді, әсіресе қазақ тілі сабағын жақсы көремін. Мұғаліміміз әрқашан күлімдеп тұрады. Түстен кейін үйге келіп, түскі ас ішемін. Содан кейін үй тапсырмасын орындаймын. Кешке аздап теледидар көремін немесе кітап оқимын. Кейде отбасымызбен серуенге шығамыз. Сағат ондар шамасында ұйықтаймын. Менің күнім осылай өтеді, және мен бұған риза боламын."
      },
      {
        "title": "Менің отбасым (Моя семья)",
        "description": "Отбасы мүшелері мен отбасылық өмір туралы.",
        "text": "Менің отбасым үлкен емес. Біз төртеуміз: әкем, анам, інім және мен. Әкем дәрігер болып жұмыс істейді. Ол адамдарға көмектескенді жақсы көреді. Анам мұғалім, мектепте қазақ тілі пәнінен сабақ береді. Інім бірінші сыныпта оқиды, ол өте көңілді бала. Біз кешке бірге тамақ ішеміз. Кейде фильм көреміз немесе үстел ойынын ойнаймыз. Демалыс күндері серуенге шығамыз. Әкем көлікті айдап, біз саябаққа барамыз. Анам бізге дәмді бәліш пісіреді. Үйіміз әрқашан жылы және шуақты. Біз бір-бірімізді жақсы көреміз және қолдаймыз. Отбасы — мен үшін ең қымбат нәрсе. Мен осындай отбасым бар болғанына қуаныштымын."
      },
      {
        "title": "Менің үйім (Мой дом)",
        "description": "Менің үйім мен тұрмысым туралы әңгіме.",
        "text": "Менің үйім кішкентай, бірақ өте жайлы. Ол екі қабатты және бақшасы бар. Үйдің алдында әдемі гүлдер өседі. Көктемде олар түрлі түске боялады. Үйіміздің ішінде төрт бөлме бар: қонақ бөлме, ас үй, жатын бөлме және менің бөлмем. Менің бөлмемнің қабырғалары көк түсті. Терезенің жанында үстелім мен кітап сөресі тұр. Онда мен сабақ оқимын және сурет саламын. Анам ас үйде жиі дәмді тағам пісіреді. Әкем кейде теледидар көреді немесе кітап оқиды. Біз кешке бәріміз бірге шай ішеміз. Үйімізде әрқашан жылы және тыныш. Мен өз үйімді жақсы көремін, өйткені ол менің отбасыма толы. Үй — менің ең сүйікті орным."
      }
    ]
  },
  {
    "level": "A2",
    "topics": [
      {
        "title": "Досымның хоббиі (Хобби моего друга)",
        "description": "Достық және хобби туралы әңгіме.",
        "text": "Менің ең жақсы досымның аты — Айдос. Біз бірінші сыныптан бері бірге оқимыз. Ол өте ақылды, көңілді және сыпайы бала. Айдос бос уақытында сурет салғанды жақсы көреді. Әсіресе табиғат пен жануарларды бейнелеуді ұнатады. Үйінде түрлі-түсті қарындаштар мен бояулары көп. Кейде мен оған модель боламын, ал ол менің суретімді салады. Суреттері өте әдемі, кейбірін мұғалімдер көрмеге қойған. Бірде ол мектептегі сурет байқауында бірінші орын алды. Біз сол күні қатты қуанып, бірге балмұздақ жедік. Айдос үлкен суретші болуды армандайды. Ол күн сайын жаттығып, жаңа техника үйренеді. Кейде интернеттен бейне сабақтар көреді. Мен оның арманы орындалатынына сенемін. Өйткені ол еңбексүйгіш және ешқашан берілмейді."
      },
      {
        "title": "Мектеп өмірі (Школьная жизнь)",
        "description": "Мектеп пен сабақтар туралы.",
        "text": "Мектеп — менің екінші үйім. Онда мен достарыммен кездесемін және көп нәрсе үйренемін. Сабақ таңертең сағат сегізде басталады. Алдымен біз гимн айтамыз, содан кейін сабаққа кіреміз. Әр мұғалім өз пәнін қызықты етіп түсіндіреді. Қазақ тілі, математика және тарих — менің сүйікті пәндерім. Үзілісте біз достармен әңгімелесеміз, кейде футбол ойнаймыз. Мектеп асханасында дәмді тағамдар бар. Мен көбіне самса мен шай аламын. Аптаның соңында кейде мерекелік шаралар өтеді. Біз ән айтамыз, би билейміз, сахнада өнер көрсетеміз. Мұғалімдер бізді әрдайым қолдайды. Мектеп мені білімге, тәртіпке және достыққа үйретті. Мен өз мектебімді мақтан тұтамын."
      },
      {
        "title": "Менің туған қалам (Мой родной город)",
        "description": "Қала және туған жер туралы әңгіме.",
        "text": "Менің туған қалам — Шымкент. Ол Қазақстанның оңтүстігінде орналасқан. Бұл қала жылы әрі әдемі. Мұнда көктем ерте келеді, ал қыс жұмсақ болады. Қаланың ортасында үлкен саябақ пен әсем гүлзарлар бар. Кешке адамдар серуендеп, демалады. Шымкентте көптеген тарихи орындар мен ескерткіштер бар. Мысалы, Қошқар ата өзені мен Цитадель — танымал жерлер. Сондай-ақ қалада жаңа мектептер мен университеттер салынуда. Экономика мен мәдениет дамып келеді. Жыл сайын жаңа жолдар мен ғимараттар пайда болады. Қала тұрғындары қонақжай әрі мейірімді. Мұнда әрқашан өмір қайнап жатады. Мен өз қаламды жақсы көремін және оның болашағына сенемін. Шымкент — менің жүрегімнің бір бөлігі."
      }
    ]
  },
  {
    "level": "B1",
    "topics": [
      {
        "title": "Қазақтың ұлттық тағамдары (Казахские национальные блюда)",
        "description": "Ұлттық тағамдар мен дәстүрлер туралы.",
        "text": "Қазақ халқының дастарханы әрдайым мол және қонақжайлы. Ең танымал тағамдардың бірі — бешбармақ. Бұл тағам ет, қамыр және сорпадан дайындалады. Әдетте оны жылқы, сиыр немесе қой етінен пісіреді. Сондай-ақ қазы мен жал қазақ дастарханында ерекше орын алады. Қазыны көбіне мереке мен тойларда ұсынады. Бауырсақ та қазақтың дәстүрлі тәтті тағамы. Оны шаймен бірге береді және ол дастарханның көркі саналады. Қазақтар «қонақ келсе — құт» деп айтады. Сол себепті әр қонаққа ең жақсы тағам беріледі. Қымыз бен шұбат — ұлттық сусындар, олар денсаулыққа пайдалы. Қымызды биенің сүтінен, ал шұбатты түйе сүтінен жасайды. Бұлар иммунитетті көтереді және шаршағанды басады. Бүгінде ұлттық тағамдар заманауи асханаларда да дайындалады. Бұл дәстүр ұлттың мәдени байлығын сақтап келеді."
      },
      {
        "title": "Табиғатты қорғау (Охрана природы)",
        "description": "Экология және қоршаған орта туралы.",
        "text": "Бүгінгі таңда табиғатты қорғау — маңызды және өзекті мәселе. Адамдар көп қоқыс тастап, ормандарды кесіп жатыр. Өзендер мен теңіздер ластанып, жануарлар тіршілігіне қауіп төнуде. Ал шындығында табиғат — біздің өміріміздің негізі. Біз таза ауа мен судың арқасында өмір сүреміз. Егер табиғатты қорғамасақ, болашақта үлкен апаттар болуы мүмкін. Әр адам өзінен бастауы керек: қоқысты жерге тастамау, суды үнемдеу, ағаш отырғызу. Мектептерде экологиялық сабақтар өткізу де маңызды. Балаларға табиғатты сүюді үйрету керек. Кейбір қалаларда сенбіліктер ұйымдастырылады. Онда адамдар өз аулаларын, саябақтарды тазалайды. Бұл — жақсы дәстүр. Табиғатты қорғау — тек бір елдің емес, бүкіл әлемнің міндеті. Егер әр адам кішкене үлес қоссa, жер шарымыз әлдеқайда таза болар еді. Табиғат — біздің ортақ үйіміз."
      },
      {
        "title": "Денсаулық және спорт (Здоровье и спорт)",
        "description": "Спорт пен денсаулықтың маңызы туралы.",
        "text": "Денсаулық — адам өміріндегі ең маңызды байлық. Егер адам дені сау болса, ол бәріне қол жеткізе алады. Спортпен шұғылдану денсаулықты нығайтады. Мен аптасына үш рет спортзалға барамын. Онда жүгіремін, гантель көтеремін, жаттығулар жасаймын. Бұл мені сергек және күшті етеді. Менің достарым да спортпен айналысады, кейде біз бірге футбол ойнаймыз. Дене белсенділігі көңіл-күйді жақсартады және стрессті азайтады. Дұрыс тамақтану да маңызды рөл атқарады. Көкөніс пен жеміс-жидек көп жеу керек. Ал фастфуд пен тәтті сусындарды азайту қажет. Күн сайын таза ауада серуендеу пайдалы. Денсаулықты сақтау — өзіңе деген құрмет. Егер әркім өз денесін күтіп ұстаса, өмір ұзақ әрі бақытты болады."
      }
    ]
  },
  {
    "level": "B2",
    "topics": [
      {
        "title": "Технология және жасөспірімдер (Технологии и подростки)",
        "description": "Технологияның пайдасы мен зияны туралы.",
        "text": "Қазіргі заманда технология адам өмірінің ажырамас бөлігіне айналды. Смартфон, интернет, компьютер — барлығы біздің күнделікті серігіміз. Әсіресе жасөспірімдер бұл құралдарды жиі пайдаланады. Олар әлеуметтік желілерде сөйлеседі, бейнелер көреді, ойын ойнайды. Бұл пайдалы болуы мүмкін, егер дұрыс қолданылса. Мысалы, интернет арқылы жаңа білім алуға, тіл үйренуге болады. Бірақ тым көп экран алдында отыру денсаулыққа зиян. Көз шаршайды, арқа ауырады, ұйқы бұзылады. Сондай-ақ, онлайн өмір кейде адамды жалғыздыққа итермелейді. Сол себепті онлайн мен офлайн өмірдің тепе-теңдігін сақтау керек. Ата-аналар мен мұғалімдер балаларға уақытты тиімді пайдалануды үйретуі тиіс. Технологияның өзі жаман емес, оны қолдану тәсілі маңызды. Егер дұрыс пайдаланса, ол адамның дамуына көмектеседі. Бірақ егер тәуелділік пайда болса, ол керісінше зиян тигізеді."
      },
      {
        "title": "Қазақстанның табиғаты (Природа Казахстана)",
        "description": "Қазақстан табиғаты мен экологиясы туралы.",
        "text": "Қазақстан — кең және әдемі ел. Оның табиғаты алуан түрлі және бай. Солтүстігінде орман мен көлдер, ал оңтүстігінде шөл мен таулар бар. Алтай таулары мен Тянь-Шаньның қарлы шыңдары көздің жауын алады. Балқаш көлі жартылай тұзды, жартылай тұщы — бұл табиғаттың ғажабы. Бурабай мен Көлсай сияқты жерлер туристер арасында танымал. Онда ауа таза, су мөлдір. Жануарлар әлемі де бай: ақбөкен, қасқыр, түлкі, бүркіт және т.б. Бірақ соңғы жылдары кейбір экологиялық мәселелер пайда болды. Орман өрттері мен ластану табиғатқа зиян келтіріп жатыр. Сол себепті қоршаған ортаны қорғау — әр азаматтың борышы. Табиғатты сақтау — ұлт болашағын сақтау. Қазақстанның табиғаты — біздің мақтанышымыз және рухани байлығымыз."
      },
      {
        "title": "Менің арман мамандығым (Моя профессия мечты)",
        "description": "Арман және болашақ мамандық туралы.",
        "text": "Бала кезімнен мен инженер болуды армандаймын. Маған әрқашан жаңа нәрсе ойлап табу қызық болатын. Мен кішкентай кезімде ойыншықтарды бөлшектеп, қалай жұмыс істейтінін түсінуге тырысатынмын. Математика мен физика пәндерін жақсы көремін. Бұл пәндер маған логикалық ойлауды үйретеді. Инженерлер жаңа көпірлер, үйлер, машиналар мен құрылғылар жасайды. Олардың еңбегі қоғам үшін өте маңызды. Болашақта мен экологиялық таза технологиялармен жұмыс істегім келеді. Мысалы, күн энергиясымен жұмыс істейтін құрылғыларды жобалау. Қазақстанның дамуына өз үлесімді қосқым келеді. Сол үшін мен жақсы оқу керек екенін білемін. Қазір мен түрлі ғылыми жобаларға қатысып жүрмін. Кейде достарыммен бірге роботтар жасаймыз. Бұл маған тәжірибе береді. Арманға жету үшін табандылық пен еңбек қажет екенін түсіндім."
      }
    ]
  },
  {
    "level": "C1",
    "topics": [
      {
        "title": "Адам және қоғам (Человек и общество)",
        "description": "Қоғам және адамгершілік туралы ойлар.",
        "text": "Адам — қоғамның ең басты бөлігі. Әр адамның ісі мен ойы қоғамның дамуына әсер етеді. Егер адамдар бір-біріне көмектессе, қоғам мықты болады. Бірақ кейде адамдар өз пайдасын ғана ойлап, өзгелерді ұмытады. Мұндай кезде әділдік жоғалады. Әр адам жауапкершілікті сезінуі керек. Біз бірге өмір сүріп, бір-бірімізге тәуелдіміз. Қоғам — үлкен отбасы сияқты: біреу ауырса, басқасы сезеді. Адамгершілік, құрмет пен мейірім — берік қоғамның негізі. Егер жастар осы құндылықтарды ұстанса, болашақ жарқын болады. Сондай-ақ білім мен мәдениет те қоғамның дамуына үлес қосады. Білімді адам — саналы азамат. Саналы азаматтар көп болса, ел де гүлденеді. Сондықтан әрқайсымыз өз ісімізді адал атқаруымыз керек. Әділетті және мейірімді қоғам құру — бәріміздің міндетіміз."
      },
      {
        "title": "Білімнің күші (Сила знаний)",
        "description": "Білім мен дамудың маңызы туралы.",
        "text": "Білім — адамды биікке көтеретін күш. Ол адамның ой-өрісін кеңейтеді және жаңа мүмкіндіктер ашады. Ежелгі заманнан бері дана адамдар білімге ұмтылған. Бүгінде білім — дамыған қоғамның басты тірегі. Технологиялар мен ғылымның дамуы білімді адамдардың арқасында мүмкін болды. Жақсы білім алған адам өмірде өз орнын таба алады. Ол өз еліне де, әлемге де пайда әкеледі. Мектеп — білімнің алғашқы баспалдағы. Бірақ оқу ешқашан тоқтамауы тиіс. Адам өмір бойы ізденіп, өзін жетілдіріп отыруы керек. Кітап оқу, зерттеу, жаңа тіл үйрену — бәрі адамның ойлау қабілетін дамытады. Білімсіз қоғам алға жылжымайды. Сондықтан әр адам өз білімін арттыруды мақсат етуі керек. Білім — жарыққа апаратын шам."
      },
      {
        "title": "Болашақ туралы ойлар (Мысли о будущем)",
        "description": "Болашақ пен адамзаттың дамуы туралы.",
        "text": "Болашақ — әр адамның арманы мен еңбегінің нәтижесі. Біз бүгін не істесек, ертең соның жемісін көреміз. Кей адамдар болашақты қорқынышпен күтеді, ал кейбіреулер сеніммен қарайды. Мен болашақтың жарқын болатынына сенемін. Өйткені жастар білімді, креативті және еңбекқор. Технологиялар дамып, өмір жеңілдеп келеді. Бірақ рухани құндылықтарды ұмытпау маңызды. Ақша мен табыс бәрі емес, бастысы — адамдық пен мейірім. Болашақта экологиялық таза қалалар мен жасыл энергия кең тарайды деп ойлаймын. Адамдар соғыссыз, тату өмір сүреді. Әркім өз ісін сүйіспеншілікпен істейді. Балалар еркін білім алып, армандарын жүзеге асырады. Болашақ — бүгіннен басталады. Егер біз қазір жауапкершілікпен әрекет етсек, ертең бақытты өмір сүреміз."
      }
    ]
  }
]
